In [2]:
import pandas as pd

monData=pd.read_csv(r'C:\Users\user\Dropbox\Cours\Machine learning\Notes Cours\Mariage\age_of_marriage_data.csv')

In [3]:
monData

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0
...,...,...,...,...,...,...,...,...,...,...
2562,2563,female,"5'3""",Hindu,Thakur,Hindi,Banking Professional,Agra,India,27.0
2563,2564,male,"5'11""",Hindu,Thakur,Hindi,Software Professional,Ottawa,Canada,31.0
2564,2565,female,"5'3""",Hindu,Baishya,Bengali,Software Consultant,Bengaluru / Bangalore,India,28.0
2565,2566,female,"4'11""",NaN,others,Telugu,Not working,Hyderabad,India,26.0
2566,2567,female,"5'2""",Christian,Marthoma,Malayalam,Software Professional,Pune,India,32.0

# EDA

In [8]:
monData.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [7]:
(monData.shape[0]-monData.dropna().shape[0])/monData.shape[0]

0.24737047136735488

In [6]:
#monData.dropna().shape[0] 6

1932

In [9]:
monData.dropna(inplace=True)

In [10]:
monData

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0
5,6,male,"5'5""",Hindu,Valmiki,Hindi,Sportsman,Delhi,India,29.0
...,...,...,...,...,...,...,...,...,...,...
2561,2562,male,"5'11""",Hindu,Kshatriya,Odia,VP / AVP / GM / DGM,Mumbai,India,30.0
2562,2563,female,"5'3""",Hindu,Thakur,Hindi,Banking Professional,Agra,India,27.0
2563,2564,male,"5'11""",Hindu,Thakur,Hindi,Software Professional,Ottawa,Canada,31.0
2564,2565,female,"5'3""",Hindu,Baishya,Bengali,Software Consultant,Bengaluru / Bangalore,India,28.0
2566,2567,female,"5'2""",Christian,Marthoma,Malayalam,Software Professional,Pune,India,32.0

In [11]:
monData.isnull().sum()

id                 0
gender             0
height             0
religion           0
caste              0
mother_tongue      0
profession         0
location           0
country            0
age_of_marriage    0
dtype: int64

In [12]:
X=monData.loc[:,['gender','height','religion','caste','mother_tongue','country']]
y=monData.age_of_marriage

In [19]:
X

      gender height   religion        caste mother_tongue  country
1       male   5'7"       Jain   Shwetamber      Gujarati      USA
2       male   5'7"      Hindu      Brahmin         Hindi    India
3     female   5'0"      Hindu       Thakur         Hindi    India
4       male   5'5"  Christian   Born Again     Malayalam    India
5       male   5'5"      Hindu      Valmiki         Hindi    India
...      ...    ...        ...          ...           ...      ...
2561    male  5'11"      Hindu    Kshatriya          Odia    India
2562  female   5'3"      Hindu       Thakur         Hindi    India
2563    male  5'11"      Hindu       Thakur         Hindi   Canada
2564  female   5'3"      Hindu      Baishya       Bengali    India
2566  female   5'2"  Christian     Marthoma     Malayalam    India

[1932 rows x 6 columns]

# Pre-Traitement/Pre Processing

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
enc=LabelEncoder()

In [24]:
X.loc[:,['gender','religion','caste','mother_tongue','country']]=X.loc[:,['gender','religion','caste','mother_tongue','country']].apply(enc.fit_transform)

In [25]:
X

     gender height religion caste mother_tongue country
1         1   5'7"        2    34             6      19
2         1   5'7"        1    14             8       5
3         0   5'0"        1    36             8       5
4         1   5'5"        0    13            13       5
5         1   5'5"        1    38             8       5
...     ...    ...      ...   ...           ...     ...
2561      1  5'11"        1    21            18       5
2562      0   5'3"        1    36             8       5
2563      1  5'11"        1    36             8       3
2564      0   5'3"        1     7             2       5
2566      0   5'2"        0    23            13       5

[1932 rows x 6 columns]

In [42]:
int(X.loc[1,'height'].split('\'')[0])*30.48

152.4

In [43]:
int((X.loc[1,'height'].split('\'')[1].replace('"','')))*2.54

17.78

In [44]:
def poid_cm(x):
    return int(x.split('\'')[0])*30.48 + int(x.split('\'')[1].replace('"',''))*2.54

In [45]:
X.height

1        5'7"
2        5'7"
3        5'0"
4        5'5"
5        5'5"
        ...
2561    5'11"
2562     5'3"
2563    5'11"
2564     5'3"
2566     5'2"
Name: height, Length: 1932, dtype: object

In [46]:
X['poid_en_cm']=X.height.apply(poid_cm)

In [47]:
X

     gender height religion caste mother_tongue country  poid_en_cm
1         1   5'7"        2    34             6      19      170.18
2         1   5'7"        1    14             8       5      170.18
3         0   5'0"        1    36             8       5      152.40
4         1   5'5"        0    13            13       5      165.10
5         1   5'5"        1    38             8       5      165.10
...     ...    ...      ...   ...           ...     ...         ...
2561      1  5'11"        1    21            18       5      180.34
2562      0   5'3"        1    36             8       5      160.02
2563      1  5'11"        1    36             8       3      180.34
2564      0   5'3"        1     7             2       5      160.02
2566      0   5'2"        0    23            13       5      157.48

[1932 rows x 7 columns]

In [48]:
X.drop('height',inplace=True,axis=1)

In [49]:
X

     gender religion caste mother_tongue country  poid_en_cm
1         1        2    34             6      19      170.18
2         1        1    14             8       5      170.18
3         0        1    36             8       5      152.40
4         1        0    13            13       5      165.10
5         1        1    38             8       5      165.10
...     ...      ...   ...           ...     ...         ...
2561      1        1    21            18       5      180.34
2562      0        1    36             8       5      160.02
2563      1        1    36             8       3      180.34
2564      0        1     7             2       5      160.02
2566      0        0    23            13       5      157.48

[1932 rows x 6 columns]

# Entrainement du modele

In [50]:
from sklearn.model_selection import train_test_split

In [51]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [52]:
from sklearn.ensemble import RandomForestRegressor

In [53]:
model=RandomForestRegressor(n_estimators=80,max_depth=11)

In [54]:
model.fit(X_train,y_train)

RandomForestRegressor(max_depth=11, n_estimators=80)

In [55]:
y_predict=model.predict(X_test)

In [56]:
from sklearn.metrics import mean_absolute_error, r2_score

In [57]:
print('MAE: ', mean_absolute_error(y_test,y_predict))
print('r2_score:',r2_score(y_test,y_predict))

MAE:  1.032425233222532
r2_score: 0.6995082023322541

In [59]:
model.score(X_test,y_test)

0.6995082023322541

# Exportation du modele

In [60]:
import joblib

In [61]:
joblib.dump(model,'ModelTDCSIL1.ml')

['ModelTDCSIL1.ml']

In [101]:
import numpy as np
model=joblib.load('ModelTDCSIL1.ml')
list1=[1990,156,0,3,8,2,40]
int_features=[float(i) for i in list1]
final_features=(int_features) 
indexDateNaissance=[1,2,3,4,5,6]
dateNaissance=np.delete(final_features,indexDateNaissance)
dateNaissance=dateNaissance[0]

In [102]:
dateNaissance

1990.0

In [103]:
AnneIndex=0
features_model=np.delete(final_features,AnneIndex)
features_model=np.array([features_model]).reshape(1,6)

In [104]:
prediction=model.predict(features_model)

In [105]:
prediction

array([33.04692041])

In [106]:
Agepredit=round(prediction[0],1)
Agepredit

33.0

In [95]:
import math

x=math.ceil(Agepredit)
x

33